configuration/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <predefined>
    <items>
      <name>ЗаместителиРуководителейФилиалов</name>
      <description>Заместители руководителей филиалов</description>
    </items>
    <items>
      <name>ЗаместителиРуководителейФилиаловIT</name>
      <description>Заместители руководителей филиалов IT</description>
    </items>
    <items>
      <name>ИзменениеНастроекФилиала</name>
      <description>Изменение настроек филиала</description>
    </items>
    <items>
      <name>ИзменениеНастроекЭскалацииОшибок</name>
      <description>Изменение настроек эскалации ошибок</description>
    </items>
    <items>
      <name>ИспользованиеГабаритногоПланирования</name>
      <description>Использование габаритного планирования</description>
    </items>
    <items>
      <name>ИспользованиеГрупповогоВнесенияТрудозатрат</name>
      <description>Использование группового внесения трудозатрат</description>
    </items>
    <items>
      <name>ОтветственныеЗаИзменениеСпискаПродуктов</name>
      <description>Ответственные за изменение списка продуктов</description>
    </items>
    <items>
      <name>ОтветственныеЗаИзменениеЮридическогоЛицаВЗаявках</name>
      <description>Ответственные за изменение юридического лица в заявках</description>
    </items>
    <items>
      <name>ОтветственныеЗаНазначениеЗаявокНаправленияРозничныеПроцессы</name>
      <description>Ответственные за назначение заявок направления розничные процессы</description>
    </items>
    <items>
      <name>ОтветственныеЗаРедактированиеГруппЗаказчиков</name>
      <description>Ответственные за редактирование групп заказчиков</description>
    </items>
    <items>
      <name>ОтветственныеЗаРедактированиеМотивационныхПрофилей</name>
      <description>Ответственные за редактирование мотивационных профилей</description>
    </items>
    <items>
      <name>ОтветственныеЗаСозданиеИИзменениеДокументовУслугиСтороннейОрганизации</name>
      <description>Ответственные за создание и изменение документов услуги сторонней организации</description>
    </items>
    <items>
      <name>РуководителиКомандИСтаршиеПрограммисты</name>
      <description>Руководители команд и старшие программисты</description>
    </items>
    <items>
      <name>РуководителиФилиалов</name>
      <description>Руководители филиалов</description>
    </items>
    <items>
      <name>РуководителиФилиаловIT</name>
      <description>Руководители филиалов IT</description>
    </items>
    <items>
      <name>СозданиеКастомныхКоманд</name>
      <description>Создание кастомных команд</description>
    </items>
    <items>
      <name>СТОиРуководителиITНаправлений</name>
      <description>СТО и руководители IT направлений</description>
    </items>
  </predefined>
  <tabularSections>
    <name>РолиКонфигурации</name>
    <attributes>
      <name>Роль</name>
      <comment>Роли только с признаком ЭтоРольКонфигурации</comment>
      <type>
        <types>CatalogRef.ПрограммныеРоли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>RocketChatID</name>
    <comment>Имя пользователя RocketChat (значение поля &quot;username&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата и время создания пользователя</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРедмайн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьВсеОповещения</name>
    <comment>Хранит признак, что пользователь отключил оповещения в настройках.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВОтделеIT</name>
    <comment>Хранит роль пользователя в IT-отделе (у роли пометка ПринадлежитITОтделу)</comment>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРабочийСтол</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиОповещений</name>
    <attributes>
      <name>КатегорияОповещения</name>
      <type>
        <types>EnumRef.КатегорииСообщенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеВРабочийСтол</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтправки</name>
      <type>
        <types>EnumRef.ЧастотаОповещенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаВзаимодействия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/CommonModules/БезопасностьПовтИсп/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.> Например:
//  
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьГруппыДоступаПользователя(Знач Пользователь = Неопределено, Знач ФилиалПользователя = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФилиалПользователя) Тогда
		ФилиалПользователя = ПараметрыСеанса.Филиал;
	КонецЕсли;
		
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаУчастники.Ссылка КАК ГруппыДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.Участники КАК ГруппыДоступаУчастники
	|ГДЕ
	|	(ВЫРАЗИТЬ(ГруппыДоступаУчастники.Элемент КАК Справочник.Пользователи)) = &Пользователь
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГруппыДоступаУчастники.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Участники КАК ГруппыДоступаУчастники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (Пользователи.Ссылка = &Пользователь)
	|			И ГруппыДоступаУчастники.Элемент = Пользователи.Должность
	|ГДЕ
	|	(ВЫРАЗИТЬ(ГруппыДоступаУчастники.Элемент КАК Справочник.Должности)) = Пользователи.Должность
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГруппыДоступаУчастники.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Участники КАК ГруппыДоступаУчастники
	|ГДЕ
	|	(ВЫРАЗИТЬ(ГруппыДоступаУчастники.Элемент КАК Справочник.Филиалы)) = &ФилиалПользователя";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ФилиалПользователя", ФилиалПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГруппыДоступа");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедуры по получению групп доступа для должности и группы разработки.
// ...
// ...

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Раздел «Служебные процедуры и функции» содержит процедуры и функции, составляющие внутреннюю 
// реализацию общего модуля. Объемные разделы модулей рекомендуется разбивать на подразделы
// по функциональному признаку.

#КонецОбласти
	
#КонецЕсли
